src/Documents/Scan_УстановкаЦенОпцийИПакетов/Scan_УстановкаЦенОпцийИПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_УстановкаЦенОпцийИПакетов</name>
  <registerRecords>InformationRegister.Scan_ЦеныКомпонентовСпецификаций</registerRecords>
  <attributes>
    <name>ИдентификаторПрайсЛиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентDealerNet</name>
    <type>
      <types>CatalogRef.Scan_СоставляющиеРасчетаЦеныПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентRetailPrice</name>
    <type>
      <types>CatalogRef.Scan_СоставляющиеРасчетаЦеныПродуктов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОпцииПродуктов</name>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетСДаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетСPartPeriod</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаDistrNet</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаDealerNet</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаRetailPrice</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НезагруженныеОпции</name>
    <attributes>
      <name>Исполнение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеновыеПакеты</name>
    <attributes>
      <name>ЦеновойПакет</name>
      <type>
        <types>CatalogRef.Scan_ЦеновыеПакеты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияЦены</name>
      <type>
        <types>EnumRef.Scan_ТипыЗначенийЦены</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетСДаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетДоДаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетСPartPeriod</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетДоPartPeriod</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаDistrNet</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаDealerNet</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаRetailPrice</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Scan_ЦеныКомпонентовСпецификаций/Scan_ЦеныКомпонентовСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ЦеныКомпонентовСпецификаций</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипЗначенияЦены</name>
    <type>
      <types>EnumRef.Scan_ТипыЗначенийЦены</types>
    </type>
  </attributes>
  <attributes>
    <name>Файл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетДоДаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетДоPartPeriod</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПрайсЛиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДействуетСPartPeriod</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.Scan_ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Опции</name>
    <type>
      <types>CatalogRef.Scan_ЦеновыеПакеты</types>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ТипыЗначенийЦены/Scan_ТипыЗначенийЦены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ТипыЗначенийЦены</name>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>Процент</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Scan_ТипыЦен/Scan_ТипыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ТипыЦен</name>
  <predefined>
    <items>
      <name>ЦенаDealerNet</name>
      <description>Цена Dealer Net</description>
    </items>
    <items>
      <name>ЦенаDistrGross</name>
      <description>Цена Distr Gross</description>
    </items>
    <items>
      <name>ЦенаDistrNet</name>
      <description>Цена Distr Net</description>
    </items>
    <items>
      <name>ЦенаRetailPrice</name>
      <description>Цена Retail Price</description>
    </items>
  </predefined>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодОкругления</name>
    <type>
      <types>EnumRef.Scan_МетодыОкругленияЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Применимость</name>
    <type>
      <types>EnumRef.Scan_ПрименимостьТиповЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Точность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/Scan_УстановкаЦенОпцийИПакетов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Scan_ЦеныКомпонентовСпецификаций.Записывать = Истина;
	
	ТипЗначенияЦеныСумма   = ПредопределенноеЗначение("Перечисление.Scan_ТипыЗначенийЦены.Сумма");
	
	ТипЦенDistrNet    = ПредопределенноеЗначение("Справочник.Scan_ТипыЦен.ЦенаDistrNet");
	ТипЦенDealerNet   = ПредопределенноеЗначение("Справочник.Scan_ТипыЦен.ЦенаDealerNet");
	ТипЦенRetailPrice = ПредопределенноеЗначение("Справочник.Scan_ТипыЦен.ЦенаRetailPrice");
	
	Для Каждого СтрокаОпции Из ЭтотОбъект.ОпцииПродуктов Цикл
		Если СтрокаОпции.ЦенаDistrNet <> 0 Тогда
			Движение = Движения.Scan_ЦеныКомпонентовСпецификаций.Добавить();
			Движение.Период                  = СтрокаОпции.ДействуетСДаты;
			Движение.ИдентификаторПрайсЛиста = ЭтотОбъект.ИдентификаторПрайсЛиста;
			Движение.ДействуетСPartPeriod    = СтрокаОпции.ДействуетСPartPeriod;
			Движение.ТипЦен                  = ТипЦенDistrNet;
			Движение.Опции                   = СтрокаОпции.Опция;
			Движение.Цена                    = СтрокаОпции.ЦенаDistrNet;
			Движение.ЦенаРегл                = СтрокаОпции.ЦенаDistrNet;
			Движение.ТипЗначенияЦены         = ТипЗначенияЦеныСумма;
			Движение.Файл                    = СтрокаОпции.Файл;
		КонецЕсли;
		
		Если СтрокаОпции.ЦенаDealerNet <> 0 Тогда
			Движение = Движения.Scan_ЦеныКомпонентовСпецификаций.Добавить();
			Движение.Период                  = СтрокаОпции.ДействуетСДаты;
			Движение.ИдентификаторПрайсЛиста = ЭтотОбъект.ИдентификаторПрайсЛиста;
			Движение.ДействуетСPartPeriod    = СтрокаОпции.ДействуетСPartPeriod;
			Движение.ТипЦен                  = ТипЦенDealerNet;
			Движение.Опции                   = СтрокаОпции.Опция;
			Движение.Цена                    = СтрокаОпции.ЦенаDealerNet;
			Движение.ЦенаРегл                = СтрокаОпции.ЦенаDealerNet;
			Движение.ТипЗначенияЦены         = ТипЗначенияЦеныСумма;
			Движение.Файл                    = СтрокаОпции.Файл;
		КонецЕсли;
		
		Если СтрокаОпции.ЦенаRetailPrice <> 0 Тогда
			Движение = Движения.Scan_ЦеныКомпонентовСпецификаций.Добавить();
			Движение.Период                  = СтрокаОпции.ДействуетСДаты;
			Движение.ИдентификаторПрайсЛиста = ЭтотОбъект.ИдентификаторПрайсЛиста;
			Движение.ДействуетСPartPeriod    = СтрокаОпции.ДействуетСPartPeriod;
			Движение.ТипЦен                  = ТипЦенRetailPrice;
			Движение.Опции                   = СтрокаОпции.Опция;
			Движение.Цена                    = СтрокаОпции.ЦенаRetailPrice;
			Движение.ЦенаРегл                = СтрокаОпции.ЦенаRetailPrice;
			Движение.ТипЗначенияЦены         = ТипЗначенияЦеныСумма;
			Движение.Файл                    = СтрокаОпции.Файл;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаПакета Из ЭтотОбъект.ЦеновыеПакеты Цикл
		Если СтрокаПакета.ЦенаDistrNet <> 0 Тогда
			Движение = Движения.Scan_ЦеныКомпонентовСпецификаций.Добавить();
			// rarus agar 30.04.2021 17322 ++
			Если ЗначениеЗаполнено(СтрокаПакета.ДействуетСДаты) Тогда
				Движение.Период              = СтрокаПакета.ДействуетСДаты;
			Иначе
				Движение.Период              = Дата;
			КонецЕсли;
			// rarus agar 30.04.2021 17322 --
			Движение.ИдентификаторПрайсЛиста = ЭтотОбъект.ИдентификаторПрайсЛиста;
			Движение.ДействуетСPartPeriod    = СтрокаПакета.ДействуетСPartPeriod;
			Движение.ТипЦен                  = ТипЦенDistrNet;
			Движение.Опции                   = СтрокаПакета.ЦеновойПакет;
			Движение.Цена                    = СтрокаПакета.ЦенаDistrNet;
			Движение.ЦенаРегл                = СтрокаПакета.ЦенаDistrNet;
			Движение.ТипЗначенияЦены         = СтрокаПакета.ТипЗначенияЦены;
			Движение.Файл                    = СтрокаПакета.Файл;
			// rarus agar 07.06.2021 17322 ++
			Движение.ДействуетДоДаты         = СтрокаПакета.ДействуетДоДаты;
			Движение.ДействуетДоPartPeriod   = СтрокаПакета.ДействуетДоPartPeriod;
			// rarus agar 07.06.2021 17322 --
		КонецЕсли;
		
		Если СтрокаПакета.ЦенаDealerNet <> 0 Тогда
			Движение = Движения.Scan_ЦеныКомпонентовСпецификаций.Добавить();
			// rarus agar 30.04.2021 17322 ++
			Если ЗначениеЗаполнено(СтрокаПакета.ДействуетСДаты) Тогда
				Движение.Период              = СтрокаПакета.ДействуетСДаты;
			Иначе
				Движение.Период              = Дата;
			КонецЕсли;
			// rarus agar 30.04.2021 17322 --
			Движение.ИдентификаторПрайсЛиста = ЭтотОбъект.ИдентификаторПрайсЛиста;
			Движение.ТипЦен                  = ТипЦенDealerNet;
			Движение.Опции                   = СтрокаПакета.ЦеновойПакет;
			Движение.Цена                    = СтрокаПакета.ЦенаDealerNet;
			Движение.ЦенаРегл                = СтрокаПакета.ЦенаDealerNet;
			Движение.ТипЗначенияЦены         = СтрокаПакета.ТипЗначенияЦены;
			Движение.Файл                    = СтрокаПакета.Файл;
			// rarus agar 07.06.2021 17322 ++
			Движение.ДействуетДоДаты         = СтрокаПакета.ДействуетДоДаты;
			Движение.ДействуетДоPartPeriod   = СтрокаПакета.ДействуетДоPartPeriod;
			// rarus agar 07.06.2021 17322 --
		КонецЕсли;
		
		Если СтрокаПакета.ЦенаRetailPrice <> 0 Тогда
			Движение = Движения.Scan_ЦеныКомпонентовСпецификаций.Добавить();
			// rarus agar 30.04.2021 17322 ++
			Если ЗначениеЗаполнено(СтрокаПакета.ДействуетСДаты) Тогда
				Движение.Период              = СтрокаПакета.ДействуетСДаты;
			Иначе
				Движение.Период              = Дата;
			КонецЕсли;
			// rarus agar 30.04.2021 17322 --
			Движение.ИдентификаторПрайсЛиста = ЭтотОбъект.ИдентификаторПрайсЛиста;
			Движение.ТипЦен                  = ТипЦенRetailPrice;
			Движение.Опции                   = СтрокаПакета.ЦеновойПакет;
			Движение.Цена                    = СтрокаПакета.ЦенаRetailPrice;
			Движение.ЦенаРегл                = СтрокаПакета.ЦенаRetailPrice;
			Движение.ТипЗначенияЦены         = СтрокаПакета.ТипЗначенияЦены;
			Движение.Файл                    = СтрокаПакета.Файл;
			// rarus agar 07.06.2021 17322 ++
			Движение.ДействуетДоДаты         = СтрокаПакета.ДействуетДоДаты;
			Движение.ДействуетДоPartPeriod   = СтрокаПакета.ДействуетДоPartPeriod;
			// rarus agar 07.06.2021 17322 --
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого СтрокаОпцииПродуктов Из ОпцииПродуктов Цикл
		Если  ЗначениеЗаполнено(СтрокаОпцииПродуктов.ДействуетСДаты)
			И ЗначениеЗаполнено(СтрокаОпцииПродуктов.ДействуетСPartPeriod)
			И Не Scan_ЦенообразованиеСервер.ДатаСоответствуетPartPeriod(СтрокаОпцииПродуктов.ДействуетСДаты, СтрокаОпцииПродуктов.ДействуетСPartPeriod) 
			Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Указанный в строке № %1 Part Period не соответствует дате начала действия'; en = 'The Part Period does not match the From Date in line # %1'"),
		                                    СтрокаОпцииПродуктов.НомерСтроки);
			Сообщить(ТекстСообщения);
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// rarus agar 30.04.2021 17322 ++
	Для Каждого СтрокаЦеновогоПакета Из ЦеновыеПакеты Цикл
		Если     ЗначениеЗаполнено(СтрокаЦеновогоПакета.ЦенаDistrNet)
			И Не ЗначениеЗаполнено(СтрокаЦеновогоПакета.ДействуетСPartPeriod)
			Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'В строке № %1 не указан Part Period'; en = 'The Part Period does not filled in line # %1'"),
											СтрокаЦеновогоПакета.НомерСтроки);
			Сообщить(ТекстСообщения);
			Отказ = Истина;
		КонецЕсли;
		Если     (ЗначениеЗаполнено(СтрокаЦеновогоПакета.ЦенаDealerNet) Или ЗначениеЗаполнено(СтрокаЦеновогоПакета.ЦенаRetailPrice))
			И Не ЗначениеЗаполнено(СтрокаЦеновогоПакета.ДействуетСДаты)
			Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'В строке № %1 не указана дата начала действия'; en = 'The From date does not filled in line # %1'"),
											СтрокаЦеновогоПакета.НомерСтроки);
			Сообщить(ТекстСообщения);
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	// rarus agar 30.04.2021 17322 --
	
КонецПроцедуры
